package com.wuba.acm.leetcode;

/**
 * desc : 矩阵
 * date : 2020/5/8 10:17 AM
 *
 * @author : dongSen
 */
class Matrix {

    static int[][] obtain() {
        return new int[][]{
                {1, 0, 1, 0, 0},
                {1, 0, 1, 1, 1},
                {1, 1, 1, 1, 1},
                {1, 0, 0, 1, 0}
        };
    }

    static char[][] obtainChar() {
        return new char[][]{
                {'1', '1', '1', '1', '1', '1', '1', '1'},
                {'1', '1', '1', '1', '1', '1', '1', '0'},
                {'1', '1', '1', '1', '1', '1', '1', '0'},
                {'1', '1', '1', '1', '1', '0', '0', '0'},
                {'0', '1', '1', '1', '1', '0', '0', '0'}
        };
    }
}
